[
    {
        "title": "Zora Token Sentiment Declines Post-Airdrop: Exploring the Impact of Recent Engagement Trends",
        "link": "https://en.coinotag.com/zora-token-sentiment-declines-post-airdrop-exploring-the-impact-of-recent-engagement-trends/",
        "snippet": "The recent decline in Zora token sentiment highlights the volatility inherent in the crypto space, especially post-airdrop. Despite initial excitement, recent statistics reveal a sharp drop in platform engagement, suggesting",
        "source": "coinotag",
        "published_at": 1746078480
    },
    {
        "title": "UK Crypto Business Closes After Customers Claim Unpaid Returns, Blocked Withdrawals",
        "link": "https://cryptonews.com/news/uk-crypto-business-btcmining-shut-down-after-customers-claim-unpaid-returns/",
        "snippet": "A UK -based crypto asset business, BTCMining, has been shut down after a number of customers from various countries reported paying for crypto mining services but not receiving the promised returns or being able to withdraw their assets, according to a statement released Wednesday. The business, which claimed to operate a mining service where customers paid to mine crypto and receive the resulting income, was accused of scamming users across several countries, including Estonia, Mauritania, Iran, New Zealand, Poland and Romania. The complaints were first brought to the attention of Action Fraud, which is the UK’s national fraud and cybercrime reporting centre. Victims claimed they had not received the mining services they had paid for, and many also faced further demands for additional payments. Upon investigation, authorities discovered that BTCMining Limited did not have a legitimate registered address in the UK, a red flag in any business operation. Claimed to operate a cryptoasset mining business Company did not have a legitimate UK address Complaints made as far away as New Zealand A UK cryptoasset business has been shut down after people from multiple countries did not receive the financial returns promised — Insolvency Service (@insolvencygovuk) April 30, 2025 UK Court Decision Shuts Down BTCMining After Global Fraud Allegations A hearing at the High Court in Manchester on 28 April 2025 led to the company’s closure. David Usher, chief investigator for the Insolvency Service, pointed to the global nature of the fraud. “The fact that BTCMining Limited was attracting customers globally makes our intervention particularly important,” Usher said. “We acted on the complaints before their reach could have affected countless more individuals. It’s vital that the public, both here in the UK and abroad, are protected from companies acting in this way.” Efforts to Contact BTCMining’s Director Fail, Raising Concerns Over Wider Impact Investigators were unable to contact the company’s director, Stibich Martins Yhaicha Luzia. He had been the sole director since the company’s incorporation in Jan. 2024. Attempts to reach him through known email addresses and telephone numbers were unsuccessful. Additionally, the company’s websites became inactive or provided no new contact details. The director’s contact address, listed with Companies House, was a residential property. The occupants were unaware of the business and had not given permission for their address to be used. Although six complaints have been formally lodged with Action Fraud, authorities believe the actual number of victims could be much higher. The complaints revealed that customers collectively lost more than $18,000. However, this figure may only represent a fraction of the total financial impact. Investigators are concerned that more individuals may have been affected. These potential victims have yet to come forward. The post UK Crypto Business Closes After Customers Claim Unpaid Returns, Blocked Withdrawals appeared first on Cryptonews .",
        "source": "cryptonews",
        "published_at": 1746078315
    },
    {
        "title": "XRP’s Strategic U.S. Focus Gains Timely Advantage",
        "link": "https://www.cryptoknowmics.com/news/xrps-strategic-u-s-focus-gains-timely-advantage/?utm_source=rss&utm_medium=rss&utm_campaign=xrps-strategic-u-s-focus-gains-timely-advantage",
        "snippet": "Ripple’s ongoing efforts to build and expand its presence within the United States market appear to be strategically timed, particularly given the evolving regulatory landscape for cryptocurrencies in the region. This focus could provide XRP with a significant advantage as clarity emerges. Building Infrastructure in a Key Market Despite previous regulatory challenges in the U.S., … Continue reading \"XRP’s Strategic U.S. Focus Gains Timely Advantage\" The post XRP’s Strategic U.S. Focus Gains Timely Advantage appeared first on Cryptoknowmics-Crypto News and Media Platform .",
        "source": "cryptoknowmics",
        "published_at": 1746078134
    },
    {
        "title": "Ripple's $5 Billion Bid to Buy Circle Rejected",
        "link": "https://coinpaper.com/8794/ripple-s-5-billion-bid-to-buy-circle-rejected",
        "snippet": "The attempted acquisition was a strategic move by Ripple to expand its influence even more in the stablecoin market, especially after Circle’s recent US IPO filing. While Ripple has not confirmed the bid, it fits in with the company’s broader expansion push, which included its recent $1.2 billion acquisition of prime brokerage Hidden Road. Ripple is also emerging from regulatory headwinds after settling with the SEC. Meanwhile, Tether is planning to launch a new US-focused stablecoin product by late 2025 or early 2026, depending on legislative progress. The firm is positioning itself as a responsible partner to US regulators while also still maintaining dominance with its $150 billion USDT. The US Treasury predicts that the stablecoin market cap could surge to $2 trillion by 2028, due to the sector’s importance in the global financial system. Ripple's Quiet Power Move Rejected Ripple reportedly made a bid of up to $5 billion to acquire Circle, the issuer of the USDC stablecoin, but the offer was rejected for being too low. This is according to a Bloomberg report on April 30. The attempted acquisition came just weeks after Circle filed for an initial public offering in the United States, which indicates a strategic move by Ripple to expand its footprint in the stablecoin market. While the deal was not accepted, it is not clear whether Ripple plans to submit a new offer. The company still has to confirm or deny the report, and no comment was received from Circle either. Ripple was last valued at $11 billion in 2024—a figure CEO Brad Garlinghouse has since called outdated—and has been on a serious acquisition streak. Earlier in April, it acquired prime brokerage firm Hidden Road for $1.2 billion to enhance trading activity related to XRP and the XRP Ledger. This aggressive expansion comes as Ripple begins to resolve long-standing legal challenges. A court ruling in August of 2024 found Ripple liable for $125 million in its case with the US Securities and Exchange Commission (SEC), which was originally filed back in 2020. However, in March, Garlinghouse stated that the SEC will not appeal the ruling, which resulted in Ripple agreeing to pay a reduced sum of $50 million. The company has also been increasingly active in certain political circles. Garlinghouse and Ripple’s chief legal officer, Stuart Alderoty, reportedly met with US President Donald Trump earlier this year. Ripple also contributed $5 million to Trump’s inauguration fund and was represented at official events on Jan. 20. Tether Eyes New US Stablecoin Launch New things are in the works for other stablecoin issuers as well. Tether, the issuer of the world’s largest stablecoin by market cap, is planning to launch a new stablecoin product specifically for the United States market as early as this year. In an April 30 interview with CNBC , CEO Paolo Ardoino stated that the move could happen by the end of 2025 or early 2026, depending on how quickly US lawmakers advance legislation regulating stablecoins. While USDT already dominates the global stablecoin market with a nearly $150 billion market cap and approximately 66% market share, its use in the United States is still limited, where Circle’s USDC is more prevalent. Paolo Ardoino during his interview with CNBC Ardoino said that Tether is working closely with US regulators and law enforcement agencies to position itself as a responsible player in the financial system. He pointed out that Tether sees itself as an exporter of the US dollar through digital rails, and described the dollar as “the best product the United States ever created.” Tether generates revenue by accepting US dollars to mint USDT and investing those funds into liquid and yield-generating assets like US Treasury bills. The company recorded a net income of close to $14 billion in 2024, which made it the most profitable stablecoin issuer. Despite the growing traction of USDC, especially after President Donald Trump’s election victory, Tether is still very confident in its dominant position. Ardoino explained that USDT was originally designed to serve users in emerging markets, like small villages in Africa or merchants in Istanbul. However, for the US market, the company is working on a “different product” that is more tailored to domestic needs. Analysts at Web3 research firm Nansen still firmly believe that the stablecoin sector is likely to follow a “winner-takes-most” dynamic, which suggests that USDT’s lead may continue even amid rising competition. Stablecoin Market Set for Massive Expansion With all of these latest developments, US dollar-pegged stablecoins could see their combined market cap surge to around $2 trillion by 2028. This is according to the United States Department of the Treasury’s Q1 2025 report that was released on April 30. Although the current stablecoin market cap sits at roughly $230 billion, the Treasury believes evolving market conditions could accelerate growth over the next three years. These digital assets have become widely used as on-chain cash equivalents and are increasingly seen as a modern payment mechanism. A stablecoin is a type of cryptocurrency that is specifically designed to maintain a stable value by being pegged to a traditional asset, like the US dollar. For example, 1 USDT or 1 USDC is typically equal to 1 USD. This stability makes stablecoins very useful for payments, trading, and storing value without the volatility of other cryptocurrencies like Bitcoin or Ethereum. Conceptual spectrum of stablecoins’ impact (Source: US Treasury ) The report also shed some light on the rise of tokenized money market funds, which offer yield-bearing alternatives to stablecoins. However, stablecoins are still deeply embedded in the blockchain economy. This latest commentary from the Treasury is another step in the US government’s growing embrace of blockchain innovation, after President Donald Trump’s second-term inauguration in January. In a December report, the Treasury already acknowledged that cryptocurrency could form the foundation of a new financial infrastructure and could also drive greater demand for US Treasurys. Stablecoin issuers like Tether and Circle invest fiat reserves in short-term, liquid instruments like Treasury bills and repurchase agreements. The Treasury revealed in December last year that this practice modestly increased demand for short-dated Treasurys. The April report also suggests that upcoming legislation will likely formalize these practices by requiring stablecoin issuers to hold short-term government debt, strengthening the connection between digital dollars and the traditional financial system. The growing use of stablecoins, however, could also exert some pressure on retail banks to offer higher interest rates to attract depositors. The current state of the stablecoin market (Source: US Treasury ) As of late April, Tether’s USDT is still the dominant player in terms of market share and its market cap of around $150 billion. Circle’s USDC follows with a market cap of approximately $60 billion.",
        "source": "coinpaper",
        "published_at": 1746077899
    },
    {
        "title": "Solana’s Kamino Token (KMNO) Surpasses $100 Million Market Cap with Impressive Trading Volume on Binance Alpha",
        "link": "https://en.coinotag.com/breakingnews/solanas-kamino-token-kmno-surpasses-100-million-market-cap-with-impressive-trading-volume-on-binance-alpha/",
        "snippet": "On May 1st, COINOTAG reported significant developments in the decentralized finance (DeFi) sector, highlighting that the Solana-based project Kamino has seen its token, KMNO, achieve a market capitalization exceeding $100",
        "source": "coinotag",
        "published_at": 1746077667
    },
    {
        "title": "Asia-Pacific markets rise in thin holiday trade after BOJ stands pat, U.S futures rise amid robust earnings from two major tech giants",
        "link": "https://seekingalpha.com/news/4438676-asia-pacific-markets-rise-in-thin-holiday-trade-after-boj-stands-pat-us-futures-rise-amid-robust-earnings-from-two-major-tech-giants?utm_source=cryptocompare.com&utm_medium=referral&feed_item_type=news",
        "snippet": "While most Asian stock markets were closed on Thursday, Japanese shares bucked the trend, rising after the Bank of Japan maintained its interest rates as widely predicted. Trading volumes were very thin as major markets, including China, Hong Kong, South Korea, Singapore, and others, were all closed for the Labor Day holiday. Japan, China, South Korea, and ASEAN countries are set to expand their emergency currency swap program, the Chiang Mai Initiative, to cover crises beyond financial shocks—such as infectious disease outbreaks and natural disasters— according to Nikkei Asia. Gold fell below $3,230 per ounce on Thursday, marking its third consecutive session of losses as easing trade tensions between the U.S. and its trading partners dented the metal’s safe-haven appeal. Japan ( NKY:IND ) rose 1.15% on Thursday to surpass 36,200, reaching a one-month-high. The Japanese yen depreciated past 143.5 per dollar on Thursday, sliding for the third straight session after the Bank of Japan kept its policy rate unchanged at 0.5%, in line with expectations. The Bank of Japan kept its key short-term interest rate unchanged at 0.5% during its May meeting, maintaining the highest level since 2008 and in line with market expectations. The central bank also slashed its growth and inflation forecasts, reducing the likelihood of future rate hikes. The BOJ now sees full-year GDP growth of 0.5% for 2025, down from January's forecast of 1%. The au Jibun Bank Japan Manufacturing PMI rose to 48.7 in April 2025, up from a flash estimate of 48.5 and March’s 12-month low of 48.4, marking a 10th straight month of contraction, due to weaker demand and worsening concerns about U.S. tariffs. Japan’s consumer confidence index fell to 31.2 in April 2025 from 34.1 in March, marking the fifth consecutive monthly decline and the lowest level since February 2023. China ( SHCOMP ) market closed, the offshore yuan traded around 7.27 per dollar, holding steady for a second straight session in thin trading due to the Labor Day holidays, while investors remained cautious as recent PMI data signaled early signs of strain from Trump’s tariffs. Hong Kong ( HSI ) market closed India ( SENSEX ) market closed Australia ( AS51 ) rose 0.24% to below 8,120 on Thursday, ending a five-day winning streak, as mining and energy stocks declined amid softer commodity prices. The Australian dollar climbed above $0.64 on Thursday, building on gains from the previous session following the release of strong trade balance data. Australia reported a trade surplus of A$6.9 billion in March, significantly higher than February’s downwardly revised A$2.85 billion and beating market expectations of A$3.13 billion. Supporting the currency further, April data showed that manufacturing activity continued to expand, with new orders rising at their fastest pace in nearly two and a half years—a positive sign for domestic demand. Taiwan on Wednesday unexpectedly raised its 2025 economic growth forecast to 3.6%, up from 3.14%, following a strong first-quarter performance driven by a surge in exports, particularly in tech, ahead of potential U.S. import tariffs. In the U.S., on Wednesday, all three major indexes ended mixed. The S&P 500 and Dow reversed early losses, rising 0.1% and 0.3%, respectively to extend their winning streak to seven days, while the Nasdaq closed 0.1% lower. Investors shrugged off recession concerns despite data revealing the first quarterly economic contraction in three years. U.S. stock futures rose sharply on Thursday, fueled by robust earnings from two major tech giants: Dow +0.55% ; S&P 500 +0.96% ; Nasdaq +1.43% . Looking ahead, investors await additional key earnings and economic reports on Thursday, with particular focus on results from Apple and Amazon. Currencies: ( JPY:USD ), ( CNY:USD ), ( AUD:USD ), ( INR:USD ), ( HKD:USD ), ( NZD:USD ). More on Asia: BOJ keeps rates unchanged, revises down its growth outlook Japan's manufacturing PMI revised upward to 48.7 in April China's manufacturing contracts in April despite stimulus measures Australia inflation steady at 2.4% in Q1, service inflation dips China says no need for U.S. farm and energy goods, but is stocking oil - report",
        "source": "seekingalpha",
        "published_at": 1746077572
    }
]